In [4]:
import requests
from bs4 import BeautifulSoup

In [5]:
data = requests.get('https://en.wikipedia.org/wiki/Rankings_of_universities_in_the_United_Kingdom')

In [6]:
soup = BeautifulSoup(data.text, 'html')

In [16]:
table = soup.find_all('table')[0]

In [28]:
rank_titles = table.find_all('th')
titles = [i.text.strip() for i in rank_titles]

In [30]:
import pandas as pd
df = pd.DataFrame(columns = titles)

In [31]:
df

Empty DataFrame
Columns: [Rank (1–10), University, Rank (11–20), University, Rank (21–30), University, Rank (31–40), University]
Index: []

In [32]:
data_row = table.find_all('tr')

In [43]:
for row in data_row[1:]:
    new = row.find_all('td')
    new_data = [i.text.strip() for i in new]
    df.loc[len(df)] = new_data

In [44]:
df

,Rank (1–10),University,Rank (11–20),University,Rank (21–30),University,Rank (31–40),University
0,1,University of Cambridge,11,University of Warwick,21,Cardiff University,31,University of Strathclyde
1,2,University of Oxford,12,University of Edinburgh,22=,University of East Anglia,32,University of Essex
2,3,London School of Economics,13,University of Surrey,22=,University of Leeds,33,Harper Adams University
3,4,University of St Andrews,14,University of Birmingham,24=,King's College London,34,University of Reading
4,5,University of Bath,15,University of Bristol,24=,University of Liverpool,35,University of Aberdeen
5,6,Imperial College London,16=,University of York,26,University of Glasgow,36,Northumbria University
6,7,Loughborough University,16=,University of Southampton,27,Queen's University Belfast,37,"Royal Holloway, University of London"
7,8,Durham University,18,University of Exeter,28,University of Nottingham,38,University of Leicester
8,9,University College London,19,University of Manchester,29,University of the Arts London,39,Aberystwyth University
9,10,Lancaster University,20,University of Sheffield,30,Newcastle University,40,Swansea University

In [45]:
df.to_csv('top_40_universities.csv', index = False)